_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (XnorConv2D)           (None, 128, 28, 28)       1152      
_________________________________________________________________
bn1 (BatchNormalization)     (None, 128, 28, 28)       512       
_________________________________________________________________
act1 (Activation)            (None, 128, 28, 28)       0         
_________________________________________________________________
conv2 (XnorConv2D)           (None, 128, 28, 28)       147456    
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 128, 14, 14)       0         
_________________________________________________________________
bn2 (BatchNormalization)     (None, 128, 14, 14)       512       
_________________________________________________________________
act2 (Activation)            (None, 128, 14, 14)       0         
_________________________________________________________________
conv3 (XnorConv2D)           (None, 256, 14, 14)       294912    
_________________________________________________________________
bn3 (BatchNormalization)     (None, 256, 14, 14)       1024      
_________________________________________________________________
act3 (Activation)            (None, 256, 14, 14)       0         
_________________________________________________________________
conv4 (XnorConv2D)           (None, 256, 14, 14)       589824    
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 256, 7, 7)         0         
_________________________________________________________________
bn4 (BatchNormalization)     (None, 256, 7, 7)         1024      
_________________________________________________________________
act4 (Activation)            (None, 256, 7, 7)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 12544)             0         
_________________________________________________________________
dense5 (XnorDense)           (None, 1024)              12845056  
_________________________________________________________________
bn5 (BatchNormalization)     (None, 1024)              4096      
_________________________________________________________________
act5 (Activation)            (None, 1024)              0         
_________________________________________________________________
dense6 (XnorDense)           (None, 10)                10240     
_________________________________________________________________
bn6 (BatchNormalization)     (None, 10)                40        
=================================================================
Total params: 13,895,848
Trainable params: 13,892,244
Non-trainable params: 3,604
