__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              (None, 1, 28, 28)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 96, 13, 13)   960         input[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 96, 6, 6)     0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 16, 6, 6)     1552        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 64, 6, 6)     1088        conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 64, 6, 6)     9280        conv2d_2[0][0]                   
__________________________________________________________________________________________________
merge_1 (Merge)                 (None, 128, 6, 6)    0           conv2d_3[0][0]                   
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 128, 6, 6)    0           merge_1[0][0]                    
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 6, 6)     2064        activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 64, 6, 6)     1088        conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 6, 6)     9280        conv2d_5[0][0]                   
__________________________________________________________________________________________________
merge_2 (Merge)                 (None, 128, 6, 6)    0           conv2d_6[0][0]                   
                                                                 conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 128, 6, 6)    0           merge_2[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 6, 6)     4128        activation_2[0][0]               
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 6, 6)    4224        conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 128, 6, 6)    36992       conv2d_8[0][0]                   
__________________________________________________________________________________________________
merge_3 (Merge)                 (None, 256, 6, 6)    0           conv2d_9[0][0]                   
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256, 6, 6)    0           merge_3[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 256, 3, 3)    0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 3, 3)     8224        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 128, 3, 3)    4224        conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 128, 3, 3)    36992       conv2d_11[0][0]                  
__________________________________________________________________________________________________
merge_4 (Merge)                 (None, 256, 3, 3)    0           conv2d_12[0][0]                  
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 256, 3, 3)    0           merge_4[0][0]                    
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 48, 3, 3)     12336       activation_4[0][0]               
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 192, 3, 3)    9408        conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 192, 3, 3)    83136       conv2d_14[0][0]                  
__________________________________________________________________________________________________
merge_5 (Merge)                 (None, 384, 3, 3)    0           conv2d_15[0][0]                  
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 384, 3, 3)    0           merge_5[0][0]                    
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 48, 3, 3)     18480       activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 192, 3, 3)    9408        conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 192, 3, 3)    83136       conv2d_17[0][0]                  
__________________________________________________________________________________________________
merge_6 (Merge)                 (None, 384, 3, 3)    0           conv2d_18[0][0]                  
                                                                 conv2d_19[0][0]                  
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 384, 3, 3)    0           merge_6[0][0]                    
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 64, 3, 3)     24640       activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 256, 3, 3)    16640       conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 256, 3, 3)    147712      conv2d_20[0][0]                  
__________________________________________________________________________________________________
merge_7 (Merge)                 (None, 512, 3, 3)    0           conv2d_21[0][0]                  
                                                                 conv2d_22[0][0]                  
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 512, 3, 3)    0           merge_7[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 512, 1, 1)    0           activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 64, 1, 1)     32832       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 256, 1, 1)    16640       conv2d_23[0][0]                  
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 256, 1, 1)    147712      conv2d_23[0][0]                  
__________________________________________________________________________________________________
merge_8 (Merge)                 (None, 512, 1, 1)    0           conv2d_24[0][0]                  
                                                                 conv2d_25[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 512, 1, 1)    0           merge_8[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512, 1, 1)    0           activation_8[0][0]               
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 10, 1, 1)     5130        dropout_1[0][0]                  
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 10, 1, 1)     0           conv2d_26[0][0]                  
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 10)           0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           110         flatten_1[0][0]                  
==================================================================================================
Total params: 727,416
Trainable params: 727,416
Non-trainable params: 0
