__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              (None, 1, 28, 28)    0                                            
__________________________________________________________________________________________________
conv1 (BinaryConv2D)            (None, 96, 28, 28)   2400        input[0][0]                      
__________________________________________________________________________________________________
bn1 (BatchNormalization)        (None, 96, 28, 28)   384         conv1[0][0]                      
__________________________________________________________________________________________________
act1 (Activation)               (None, 96, 28, 28)   0           bn1[0][0]                        
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 96, 14, 14)   0           act1[0][0]                       
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 16, 14, 14)   1552        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 64, 14, 14)   1088        conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 64, 14, 14)   9280        conv2d_1[0][0]                   
__________________________________________________________________________________________________
merge_1 (Merge)                 (None, 128, 14, 14)  0           conv2d_2[0][0]                   
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 16, 14, 14)   2064        merge_1[0][0]                    
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 64, 14, 14)   1088        conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 64, 14, 14)   9280        conv2d_4[0][0]                   
__________________________________________________________________________________________________
merge_2 (Merge)                 (None, 128, 14, 14)  0           conv2d_5[0][0]                   
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 14, 14)   4128        merge_2[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 128, 14, 14)  4224        conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 14, 14)  36992       conv2d_7[0][0]                   
__________________________________________________________________________________________________
merge_3 (Merge)                 (None, 256, 14, 14)  0           conv2d_8[0][0]                   
                                                                 conv2d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 256, 7, 7)    0           merge_3[0][0]                    
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 7, 7)     8224        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 128, 7, 7)    4224        conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 128, 7, 7)    36992       conv2d_10[0][0]                  
__________________________________________________________________________________________________
merge_4 (Merge)                 (None, 256, 7, 7)    0           conv2d_11[0][0]                  
                                                                 conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 48, 7, 7)     12336       merge_4[0][0]                    
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 192, 7, 7)    9408        conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 192, 7, 7)    83136       conv2d_13[0][0]                  
__________________________________________________________________________________________________
merge_5 (Merge)                 (None, 384, 7, 7)    0           conv2d_14[0][0]                  
                                                                 conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 48, 7, 7)     18480       merge_5[0][0]                    
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 192, 7, 7)    9408        conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 192, 7, 7)    83136       conv2d_16[0][0]                  
__________________________________________________________________________________________________
merge_6 (Merge)                 (None, 384, 7, 7)    0           conv2d_17[0][0]                  
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 64, 7, 7)     24640       merge_6[0][0]                    
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 256, 7, 7)    16640       conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 256, 7, 7)    147712      conv2d_19[0][0]                  
__________________________________________________________________________________________________
merge_7 (Merge)                 (None, 512, 7, 7)    0           conv2d_20[0][0]                  
                                                                 conv2d_21[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 512, 3, 3)    0           merge_7[0][0]                    
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 64, 3, 3)     32832       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 256, 3, 3)    16640       conv2d_22[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 256, 3, 3)    147712      conv2d_22[0][0]                  
__________________________________________________________________________________________________
merge_8 (Merge)                 (None, 512, 3, 3)    0           conv2d_23[0][0]                  
                                                                 conv2d_24[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512, 3, 3)    0           merge_8[0][0]                    
__________________________________________________________________________________________________
conv10 (BinaryConv2D)           (None, 10, 3, 3)     5120        dropout_1[0][0]                  
__________________________________________________________________________________________________
conv10_bn (BatchNormalization)  (None, 10, 3, 3)     12          conv10[0][0]                     
__________________________________________________________________________________________________
avgpool10 (GlobalAveragePooling (None, 10)           0           conv10_bn[0][0]                  
__________________________________________________________________________________________________
softmax (Activation)            (None, 10)           0           avgpool10[0][0]                  
==================================================================================================
Total params: 729,132
Trainable params: 728,934
Non-trainable params: 198
__________________________________________________________________________________________________

(60000, 'train samples')
(10000, 'test samples')
Train on 60000 samples, validate on 10000 samples
Epoch 1/200
60000/60000 [==============================] - 2172s 36ms/step - loss: 0.9856 - acc: 0.8394 - val_loss: 0.9226 - val_acc: 0.9751

Epoch 00001: val_acc improved from -inf to 0.97510, saving model to SX10_weights-improvement-01-0.98.hdf5
Epoch 2/200
 9856/60000 [===>..........................] - ETA: 29:05 - loss: 0.9265 - acc: 0.9781

