__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              (None, 1, 28, 28)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 96, 12, 12)   2496        input[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 96, 6, 6)     0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 16, 6, 6)     1552        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 64, 6, 6)     1088        conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 64, 6, 6)     9280        conv2d_2[0][0]                   
__________________________________________________________________________________________________
merge_1 (Merge)                 (None, 128, 6, 6)    0           conv2d_3[0][0]                   
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 6, 6)     2064        merge_1[0][0]                    
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 64, 6, 6)     1088        conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 6, 6)     9280        conv2d_5[0][0]                   
__________________________________________________________________________________________________
merge_2 (Merge)                 (None, 128, 6, 6)    0           conv2d_6[0][0]                   
                                                                 conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 6, 6)     4128        merge_2[0][0]                    
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 6, 6)    4224        conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 128, 6, 6)    36992       conv2d_8[0][0]                   
__________________________________________________________________________________________________
merge_3 (Merge)                 (None, 256, 6, 6)    0           conv2d_9[0][0]                   
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 256, 3, 3)    0           merge_3[0][0]                    
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 3, 3)     8224        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 128, 3, 3)    4224        conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 128, 3, 3)    36992       conv2d_11[0][0]                  
__________________________________________________________________________________________________
merge_4 (Merge)                 (None, 256, 3, 3)    0           conv2d_12[0][0]                  
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 48, 3, 3)     12336       merge_4[0][0]                    
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 192, 3, 3)    9408        conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 192, 3, 3)    83136       conv2d_14[0][0]                  
__________________________________________________________________________________________________
merge_5 (Merge)                 (None, 384, 3, 3)    0           conv2d_15[0][0]                  
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 48, 3, 3)     18480       merge_5[0][0]                    
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 192, 3, 3)    9408        conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 192, 3, 3)    83136       conv2d_17[0][0]                  
__________________________________________________________________________________________________
merge_6 (Merge)                 (None, 384, 3, 3)    0           conv2d_18[0][0]                  
                                                                 conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 64, 3, 3)     24640       merge_6[0][0]                    
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 256, 3, 3)    16640       conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 256, 3, 3)    147712      conv2d_20[0][0]                  
__________________________________________________________________________________________________
merge_7 (Merge)                 (None, 512, 3, 3)    0           conv2d_21[0][0]                  
                                                                 conv2d_22[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 512, 1, 1)    0           merge_7[0][0]                    
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 64, 1, 1)     32832       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 256, 1, 1)    16640       conv2d_23[0][0]                  
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 256, 1, 1)    147712      conv2d_23[0][0]                  
__________________________________________________________________________________________________
merge_8 (Merge)                 (None, 512, 1, 1)    0           conv2d_24[0][0]                  
                                                                 conv2d_25[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512, 1, 1)    0           merge_8[0][0]                    
__________________________________________________________________________________________________
conv10 (XnorConv2D)             (None, 10, 1, 1)     5120        dropout_1[0][0]                  
__________________________________________________________________________________________________
conv10_bn (BatchNormalization)  (None, 10, 1, 1)     40          conv10[0][0]                     
__________________________________________________________________________________________________
avgpool10 (GlobalAveragePooling (None, 10)           0           conv10_bn[0][0]                  
__________________________________________________________________________________________________
softmax (Activation)            (None, 10)           0           avgpool10[0][0]                  
==================================================================================================
Total params: 728,872
Trainable params: 728,852
Non-trainable params: 20
__________________________________________________________________________________________________
(60000, 'train samples')
(10000, 'test samples')
Train on 60000 samples, validate on 10000 samples
Epoch 1/200
60000/60000 [==============================] - 282s 5ms/step - loss: 1.1674 - acc: 0.1597 - val_loss: 1.1648 - val_acc: 0.1683
Epoch 2/200
60000/60000 [==============================] - 277s 5ms/step - loss: 1.1614 - acc: 0.1775 - val_loss: 1.1574 - val_acc: 0.1983
Epoch 3/200
60000/60000 [==============================] - 1016s 17ms/step - loss: 1.1594 - acc: 0.1821 - val_loss: 1.1563 - val_acc: 0.1948
Epoch 4/200
60000/60000 [==============================] - 291s 5ms/step - loss: 1.1582 - acc: 0.1832 - val_loss: 1.1560 - val_acc: 0.1827
Epoch 5/200
60000/60000 [==============================] - 286s 5ms/step - loss: 1.1572 - acc: 0.1888 - val_loss: 1.1597 - val_acc: 0.1703
Epoch 6/200
60000/60000 [==============================] - 291s 5ms/step - loss: 1.1566 - acc: 0.1897 - val_loss: 1.1652 - val_acc: 0.1565
Epoch 7/200
60000/60000 [==============================] - 1432s 24ms/step - loss: 1.1559 - acc: 0.1941 - val_loss: 1.1764 - val_acc: 0.1425
Epoch 8/200
60000/60000 [==============================] - 275s 5ms/step - loss: 1.1557 - acc: 0.1934 - val_loss: 1.1784 - val_acc: 0.1425
Epoch 9/200
60000/60000 [==============================] - 296s 5ms/step - loss: 1.1553 - acc: 0.1933 - val_loss: 1.2089 - val_acc: 0.1256
Epoch 10/200
60000/60000 [==============================] - 316s 5ms/step - loss: 1.1552 - acc: 0.1958 - val_loss: 1.2174 - val_acc: 0.1204

