__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              (None, 1, 28, 28)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 96, 12, 12)   2496        input[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 96, 6, 6)     0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 16, 6, 6)     1552        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 64, 6, 6)     1088        conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 64, 6, 6)     9280        conv2d_2[0][0]                   
__________________________________________________________________________________________________
merge_1 (Merge)                 (None, 128, 6, 6)    0           conv2d_3[0][0]                   
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 6, 6)     2064        merge_1[0][0]                    
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 64, 6, 6)     1088        conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 6, 6)     9280        conv2d_5[0][0]                   
__________________________________________________________________________________________________
merge_2 (Merge)                 (None, 128, 6, 6)    0           conv2d_6[0][0]                   
                                                                 conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 6, 6)     4128        merge_2[0][0]                    
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 6, 6)    4224        conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 128, 6, 6)    36992       conv2d_8[0][0]                   
__________________________________________________________________________________________________
merge_3 (Merge)                 (None, 256, 6, 6)    0           conv2d_9[0][0]                   
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 256, 3, 3)    0           merge_3[0][0]                    
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 3, 3)     8224        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 128, 3, 3)    4224        conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 128, 3, 3)    36992       conv2d_11[0][0]                  
__________________________________________________________________________________________________
merge_4 (Merge)                 (None, 256, 3, 3)    0           conv2d_12[0][0]                  
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 48, 3, 3)     12336       merge_4[0][0]                    
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 192, 3, 3)    9408        conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 192, 3, 3)    83136       conv2d_14[0][0]                  
__________________________________________________________________________________________________
merge_5 (Merge)                 (None, 384, 3, 3)    0           conv2d_15[0][0]                  
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 48, 3, 3)     18480       merge_5[0][0]                    
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 192, 3, 3)    9408        conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 192, 3, 3)    83136       conv2d_17[0][0]                  
__________________________________________________________________________________________________
merge_6 (Merge)                 (None, 384, 3, 3)    0           conv2d_18[0][0]                  
                                                                 conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 64, 3, 3)     24640       merge_6[0][0]                    
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 256, 3, 3)    16640       conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 256, 3, 3)    147712      conv2d_20[0][0]                  
__________________________________________________________________________________________________
merge_7 (Merge)                 (None, 512, 3, 3)    0           conv2d_21[0][0]                  
                                                                 conv2d_22[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 512, 1, 1)    0           merge_7[0][0]                    
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 64, 1, 1)     32832       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 256, 1, 1)    16640       conv2d_23[0][0]                  
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 256, 1, 1)    147712      conv2d_23[0][0]                  
__________________________________________________________________________________________________
merge_8 (Merge)                 (None, 512, 1, 1)    0           conv2d_24[0][0]                  
                                                                 conv2d_25[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512, 1, 1)    0           merge_8[0][0]                    
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 10, 1, 1)     5130        dropout_1[0][0]                  
__________________________________________________________________________________________________
conv10_bn (BatchNormalization)  (None, 10, 1, 1)     4           conv2d_26[0][0]                  
__________________________________________________________________________________________________
avgpool10 (GlobalAveragePooling (None, 10)           0           conv10_bn[0][0]                  
__________________________________________________________________________________________________
softmax (Activation)            (None, 10)           0           avgpool10[0][0]                  
==================================================================================================
Total params: 728,846
Trainable params: 728,844
Non-trainable params: 2
__________________________________________________________________________________________________
(60000, 'train samples')
(10000, 'test samples')
Train on 60000 samples, validate on 10000 samples
Epoch 1/200
60000/60000 [==============================] - 430s 7ms/step - loss: 1.0158 - acc: 0.7048 - val_loss: 0.9206 - val_acc: 0.9667

Epoch 00001: val_acc improved from -inf to 0.96670, saving model to weights-improvement-01-0.97.hdf5
Epoch 2/200
60000/60000 [==============================] - 1892s 32ms/step - loss: 0.9230 - acc: 0.9681 - val_loss: 0.9130 - val_acc: 0.9778

Epoch 00002: val_acc improved from 0.96670 to 0.97780, saving model to weights-improvement-02-0.98.hdf5
Epoch 3/200
60000/60000 [==============================] - 307s 5ms/step - loss: 0.9153 - acc: 0.9744 - val_loss: 0.9093 - val_acc: 0.9804

Epoch 00003: val_acc improved from 0.97780 to 0.98040, saving model to weights-improvement-03-0.98.hdf5
Epoch 4/200
60000/60000 [==============================] - 305s 5ms/step - loss: 0.9122 - acc: 0.9771 - val_loss: 0.9073 - val_acc: 0.9850

Epoch 00004: val_acc improved from 0.98040 to 0.98500, saving model to weights-improvement-04-0.98.hdf5
Epoch 5/200
60000/60000 [==============================] - 450s 8ms/step - loss: 0.9100 - acc: 0.9802 - val_loss: 0.9080 - val_acc: 0.9818

Epoch 00005: val_acc did not improve
Epoch 6/200
60000/60000 [==============================] - 295s 5ms/step - loss: 0.9090 - acc: 0.9811 - val_loss: 0.9080 - val_acc: 0.9831

Epoch 00006: val_acc did not improve
Epoch 7/200
60000/60000 [==============================] - 303s 5ms/step - loss: 0.9088 - acc: 0.9805 - val_loss: 0.9081 - val_acc: 0.9806

Epoch 00007: val_acc did not improve
Epoch 8/200

